GopalSaraf/Practicals/PSDL/include/proc/pic16f18855.inc
// Register: ADSTPTL
#define ADSTPTL ADSTPTL
ADSTPTL                                  equ 0112h
// bitfield definitions
ADSTPTL_ADSTPTL_POSN                     equ 0000h
ADSTPTL_ADSTPTL_POSITION                 equ 0000h
ADSTPTL_ADSTPTL_SIZE                     equ 0008h
ADSTPTL_ADSTPTL_LENGTH                   equ 0008h
ADSTPTL_ADSTPTL_MASK                     equ 00FFh
ADSTPTL_ADSTPT0_POSN                     equ 0000h
ADSTPTL_ADSTPT0_POSITION                 equ 0000h
ADSTPTL_ADSTPT0_SIZE                     equ 0001h
ADSTPTL_ADSTPT0_LENGTH                   equ 0001h
ADSTPTL_ADSTPT0_MASK                     equ 0001h
ADSTPTL_ADSTPT1_POSN                     equ 0001h
ADSTPTL_ADSTPT1_POSITION                 equ 0001h
ADSTPTL_ADSTPT1_SIZE                     equ 0001h
ADSTPTL_ADSTPT1_LENGTH                   equ 0001h
ADSTPTL_ADSTPT1_MASK                     equ 0002h
ADSTPTL_ADSTPT2_POSN                     equ 0002h
ADSTPTL_ADSTPT2_POSITION                 equ 0002h
ADSTPTL_ADSTPT2_SIZE                     equ 0001h
ADSTPTL_ADSTPT2_LENGTH                   equ 0001h
ADSTPTL_ADSTPT2_MASK                     equ 0004h
ADSTPTL_ADSTPT3_POSN                     equ 0003h
ADSTPTL_ADSTPT3_POSITION                 equ 0003h
ADSTPTL_ADSTPT3_SIZE                     equ 0001h
ADSTPTL_ADSTPT3_LENGTH                   equ 0001h
ADSTPTL_ADSTPT3_MASK                     equ 0008h
ADSTPTL_ADSTPT4_POSN                     equ 0004h
ADSTPTL_ADSTPT4_POSITION                 equ 0004h
ADSTPTL_ADSTPT4_SIZE                     equ 0001h
ADSTPTL_ADSTPT4_LENGTH                   equ 0001h
ADSTPTL_ADSTPT4_MASK                     equ 0010h
ADSTPTL_ADSTPT5_POSN                     equ 0005h
ADSTPTL_ADSTPT5_POSITION                 equ 0005h
ADSTPTL_ADSTPT5_SIZE                     equ 0001h
ADSTPTL_ADSTPT5_LENGTH                   equ 0001h
ADSTPTL_ADSTPT5_MASK                     equ 0020h
ADSTPTL_ADSTPT6_POSN                     equ 0006h
ADSTPTL_ADSTPT6_POSITION                 equ 0006h
ADSTPTL_ADSTPT6_SIZE                     equ 0001h
ADSTPTL_ADSTPT6_LENGTH                   equ 0001h
ADSTPTL_ADSTPT6_MASK                     equ 0040h
ADSTPTL_ADSTPT7_POSN                     equ 0007h
ADSTPTL_ADSTPT7_POSITION                 equ 0007h
ADSTPTL_ADSTPT7_SIZE                     equ 0001h
ADSTPTL_ADSTPT7_LENGTH                   equ 0001h
ADSTPTL_ADSTPT7_MASK                     equ 0080h

// Register: ADSTPTH
#define ADSTPTH ADSTPTH
ADSTPTH                                  equ 0113h
// bitfield definitions
ADSTPTH_ADSTPTH_POSN                     equ 0000h
ADSTPTH_ADSTPTH_POSITION                 equ 0000h
ADSTPTH_ADSTPTH_SIZE                     equ 0008h
ADSTPTH_ADSTPTH_LENGTH                   equ 0008h
ADSTPTH_ADSTPTH_MASK                     equ 00FFh
ADSTPTH_ADSTPT8_POSN                     equ 0000h
ADSTPTH_ADSTPT8_POSITION                 equ 0000h
ADSTPTH_ADSTPT8_SIZE                     equ 0001h
ADSTPTH_ADSTPT8_LENGTH                   equ 0001h
ADSTPTH_ADSTPT8_MASK                     equ 0001h
ADSTPTH_ADSTPT9_POSN                     equ 0001h
ADSTPTH_ADSTPT9_POSITION                 equ 0001h
ADSTPTH_ADSTPT9_SIZE                     equ 0001h
ADSTPTH_ADSTPT9_LENGTH                   equ 0001h
ADSTPTH_ADSTPT9_MASK                     equ 0002h
ADSTPTH_ADSTPT10_POSN                    equ 0002h
ADSTPTH_ADSTPT10_POSITION                equ 0002h
ADSTPTH_ADSTPT10_SIZE                    equ 0001h
ADSTPTH_ADSTPT10_LENGTH                  equ 0001h
ADSTPTH_ADSTPT10_MASK                    equ 0004h
ADSTPTH_ADSTPT11_POSN                    equ 0003h
ADSTPTH_ADSTPT11_POSITION                equ 0003h
ADSTPTH_ADSTPT11_SIZE                    equ 0001h
ADSTPTH_ADSTPT11_LENGTH                  equ 0001h
ADSTPTH_ADSTPT11_MASK                    equ 0008h
ADSTPTH_ADSTPT12_POSN                    equ 0004h
ADSTPTH_ADSTPT12_POSITION                equ 0004h
ADSTPTH_ADSTPT12_SIZE                    equ 0001h
ADSTPTH_ADSTPT12_LENGTH                  equ 0001h
ADSTPTH_ADSTPT12_MASK                    equ 0010h
ADSTPTH_ADSTPT13_POSN                    equ 0005h
ADSTPTH_ADSTPT13_POSITION                equ 0005h
ADSTPTH_ADSTPT13_SIZE                    equ 0001h
ADSTPTH_ADSTPT13_LENGTH                  equ 0001h
ADSTPTH_ADSTPT13_MASK                    equ 0020h
ADSTPTH_ADSTPT14_POSN                    equ 0006h
ADSTPTH_ADSTPT14_POSITION                equ 0006h
ADSTPTH_ADSTPT14_SIZE                    equ 0001h
ADSTPTH_ADSTPT14_LENGTH                  equ 0001h
ADSTPTH_ADSTPT14_MASK                    equ 0040h
ADSTPTH_ADSTPT15_POSN                    equ 0007h
ADSTPTH_ADSTPT15_POSITION                equ 0007h
ADSTPTH_ADSTPT15_SIZE                    equ 0001h
ADSTPTH_ADSTPT15_LENGTH                  equ 0001h
ADSTPTH_ADSTPT15_MASK                    equ 0080h

// Register: ADFLTRL
#define ADFLTRL ADFLTRL
ADFLTRL                                  equ 0114h
// bitfield definitions
ADFLTRL_ADFLTRL_POSN                     equ 0000h
ADFLTRL_ADFLTRL_POSITION                 equ 0000h
ADFLTRL_ADFLTRL_SIZE                     equ 0008h
ADFLTRL_ADFLTRL_LENGTH                   equ 0008h
ADFLTRL_ADFLTRL_MASK                     equ 00FFh
ADFLTRL_ADFLTR0_POSN                     equ 0000h
ADFLTRL_ADFLTR0_POSITION                 equ 0000h
ADFLTRL_ADFLTR0_SIZE                     equ 0001h
ADFLTRL_ADFLTR0_LENGTH                   equ 0001h
ADFLTRL_ADFLTR0_MASK                     equ 0001h
ADFLTRL_ADFLTR1_POSN                     equ 0001h
ADFLTRL_ADFLTR1_POSITION                 equ 0001h
ADFLTRL_ADFLTR1_SIZE                     equ 0001h
ADFLTRL_ADFLTR1_LENGTH                   equ 0001h
ADFLTRL_ADFLTR1_MASK                     equ 0002h
ADFLTRL_ADFLTR2_POSN                     equ 0002h
ADFLTRL_ADFLTR2_POSITION                 equ 0002h
ADFLTRL_ADFLTR2_SIZE                     equ 0001h
ADFLTRL_ADFLTR2_LENGTH                   equ 0001h
ADFLTRL_ADFLTR2_MASK                     equ 0004h
ADFLTRL_ADFLTR3_POSN                     equ 0003h
ADFLTRL_ADFLTR3_POSITION                 equ 0003h
ADFLTRL_ADFLTR3_SIZE                     equ 0001h
ADFLTRL_ADFLTR3_LENGTH                   equ 0001h
ADFLTRL_ADFLTR3_MASK                     equ 0008h
ADFLTRL_ADFLTR4_POSN                     equ 0004h
ADFLTRL_ADFLTR4_POSITION                 equ 0004h
ADFLTRL_ADFLTR4_SIZE                     equ 0001h
ADFLTRL_ADFLTR4_LENGTH                   equ 0001h
ADFLTRL_ADFLTR4_MASK                     equ 0010h
ADFLTRL_ADFLTR5_POSN                     equ 0005h
ADFLTRL_ADFLTR5_POSITION                 equ 0005h
ADFLTRL_ADFLTR5_SIZE                     equ 0001h
ADFLTRL_ADFLTR5_LENGTH                   equ 0001h
ADFLTRL_ADFLTR5_MASK                     equ 0020h
ADFLTRL_ADFLTR6_POSN                     equ 0006h
ADFLTRL_ADFLTR6_POSITION                 equ 0006h
ADFLTRL_ADFLTR6_SIZE                     equ 0001h
ADFLTRL_ADFLTR6_LENGTH                   equ 0001h
ADFLTRL_ADFLTR6_MASK                     equ 0040h
ADFLTRL_ADFLTR7_POSN                     equ 0007h
ADFLTRL_ADFLTR7_POSITION                 equ 0007h
ADFLTRL_ADFLTR7_SIZE                     equ 0001h
ADFLTRL_ADFLTR7_LENGTH                   equ 0001h
ADFLTRL_ADFLTR7_MASK                     equ 0080h

// Register: ADFLTRH
#define ADFLTRH ADFLTRH
ADFLTRH                                  equ 0115h
// bitfield definitions
ADFLTRH_ADFLTRH_POSN                     equ 0000h
ADFLTRH_ADFLTRH_POSITION                 equ 0000h
ADFLTRH_ADFLTRH_SIZE                     equ 0008h
ADFLTRH_ADFLTRH_LENGTH                   equ 0008h
ADFLTRH_ADFLTRH_MASK                     equ 00FFh
ADFLTRH_ADFLTR8_POSN                     equ 0000h
ADFLTRH_ADFLTR8_POSITION                 equ 0000h
ADFLTRH_ADFLTR8_SIZE                     equ 0001h
ADFLTRH_ADFLTR8_LENGTH                   equ 0001h
ADFLTRH_ADFLTR8_MASK                     equ 0001h
ADFLTRH_ADFLTR9_POSN                     equ 0001h
ADFLTRH_ADFLTR9_POSITION                 equ 0001h
ADFLTRH_ADFLTR9_SIZE                     equ 0001h
ADFLTRH_ADFLTR9_LENGTH                   equ 0001h
ADFLTRH_ADFLTR9_MASK                     equ 0002h
ADFLTRH_ADFLTR10_POSN                    equ 0002h
ADFLTRH_ADFLTR10_POSITION                equ 0002h
ADFLTRH_ADFLTR10_SIZE                    equ 0001h
ADFLTRH_ADFLTR10_LENGTH                  equ 0001h
ADFLTRH_ADFLTR10_MASK                    equ 0004h
ADFLTRH_ADFLTR11_POSN                    equ 0003h
ADFLTRH_ADFLTR11_POSITION                equ 0003h
ADFLTRH_ADFLTR11_SIZE                    equ 0001h
ADFLTRH_ADFLTR11_LENGTH                  equ 0001h
ADFLTRH_ADFLTR11_MASK                    equ 0008h
ADFLTRH_ADFLTR12_POSN                    equ 0004h
ADFLTRH_ADFLTR12_POSITION                equ 0004h
ADFLTRH_ADFLTR12_SIZE                    equ 0001h
ADFLTRH_ADFLTR12_LENGTH                  equ 0001h
ADFLTRH_ADFLTR12_MASK                    equ 0010h
ADFLTRH_ADFLTR13_POSN                    equ 0005h
ADFLTRH_ADFLTR13_POSITION                equ 0005h
ADFLTRH_ADFLTR13_SIZE                    equ 0001h
ADFLTRH_ADFLTR13_LENGTH                  equ 0001h
ADFLTRH_ADFLTR13_MASK                    equ 0020h
ADFLTRH_ADFLTR14_POSN                    equ 0006h
ADFLTRH_ADFLTR14_POSITION                equ 0006h
ADFLTRH_ADFLTR14_SIZE                    equ 0001h
ADFLTRH_ADFLTR14_LENGTH                  equ 0001h
ADFLTRH_ADFLTR14_MASK                    equ 0040h
ADFLTRH_ADFLTR15_POSN                    equ 0007h
ADFLTRH_ADFLTR15_POSITION                equ 0007h
ADFLTRH_ADFLTR15_SIZE                    equ 0001h
ADFLTRH_ADFLTR15_LENGTH                  equ 0001h
ADFLTRH_ADFLTR15_MASK                    equ 0080h

