GopalSaraf/Practicals/PSDL/include/proc/pic16f18855.inc
// Register: T4AINPPS
#define T4AINPPS T4AINPPS
T4AINPPS                                 equ 0E9Dh
// bitfield definitions
T4AINPPS_T4AINPPS_POSN                   equ 0000h
T4AINPPS_T4AINPPS_POSITION               equ 0000h
T4AINPPS_T4AINPPS_SIZE                   equ 0005h
T4AINPPS_T4AINPPS_LENGTH                 equ 0005h
T4AINPPS_T4AINPPS_MASK                   equ 001Fh
T4AINPPS_T4AINPPS0_POSN                  equ 0000h
T4AINPPS_T4AINPPS0_POSITION              equ 0000h
T4AINPPS_T4AINPPS0_SIZE                  equ 0001h
T4AINPPS_T4AINPPS0_LENGTH                equ 0001h
T4AINPPS_T4AINPPS0_MASK                  equ 0001h
T4AINPPS_T4AINPPS1_POSN                  equ 0001h
T4AINPPS_T4AINPPS1_POSITION              equ 0001h
T4AINPPS_T4AINPPS1_SIZE                  equ 0001h
T4AINPPS_T4AINPPS1_LENGTH                equ 0001h
T4AINPPS_T4AINPPS1_MASK                  equ 0002h
T4AINPPS_T4AINPPS2_POSN                  equ 0002h
T4AINPPS_T4AINPPS2_POSITION              equ 0002h
T4AINPPS_T4AINPPS2_SIZE                  equ 0001h
T4AINPPS_T4AINPPS2_LENGTH                equ 0001h
T4AINPPS_T4AINPPS2_MASK                  equ 0004h
T4AINPPS_T4AINPPS3_POSN                  equ 0003h
T4AINPPS_T4AINPPS3_POSITION              equ 0003h
T4AINPPS_T4AINPPS3_SIZE                  equ 0001h
T4AINPPS_T4AINPPS3_LENGTH                equ 0001h
T4AINPPS_T4AINPPS3_MASK                  equ 0008h
T4AINPPS_T4AINPPS4_POSN                  equ 0004h
T4AINPPS_T4AINPPS4_POSITION              equ 0004h
T4AINPPS_T4AINPPS4_SIZE                  equ 0001h
T4AINPPS_T4AINPPS4_LENGTH                equ 0001h
T4AINPPS_T4AINPPS4_MASK                  equ 0010h

// Register: T6AINPPS
#define T6AINPPS T6AINPPS
T6AINPPS                                 equ 0E9Eh
// bitfield definitions
T6AINPPS_T6AINPPS_POSN                   equ 0000h
T6AINPPS_T6AINPPS_POSITION               equ 0000h
T6AINPPS_T6AINPPS_SIZE                   equ 0005h
T6AINPPS_T6AINPPS_LENGTH                 equ 0005h
T6AINPPS_T6AINPPS_MASK                   equ 001Fh
T6AINPPS_T6AINPPS0_POSN                  equ 0000h
T6AINPPS_T6AINPPS0_POSITION              equ 0000h
T6AINPPS_T6AINPPS0_SIZE                  equ 0001h
T6AINPPS_T6AINPPS0_LENGTH                equ 0001h
T6AINPPS_T6AINPPS0_MASK                  equ 0001h
T6AINPPS_T6AINPPS1_POSN                  equ 0001h
T6AINPPS_T6AINPPS1_POSITION              equ 0001h
T6AINPPS_T6AINPPS1_SIZE                  equ 0001h
T6AINPPS_T6AINPPS1_LENGTH                equ 0001h
T6AINPPS_T6AINPPS1_MASK                  equ 0002h
T6AINPPS_T6AINPPS2_POSN                  equ 0002h
T6AINPPS_T6AINPPS2_POSITION              equ 0002h
T6AINPPS_T6AINPPS2_SIZE                  equ 0001h
T6AINPPS_T6AINPPS2_LENGTH                equ 0001h
T6AINPPS_T6AINPPS2_MASK                  equ 0004h
T6AINPPS_T6AINPPS3_POSN                  equ 0003h
T6AINPPS_T6AINPPS3_POSITION              equ 0003h
T6AINPPS_T6AINPPS3_SIZE                  equ 0001h
T6AINPPS_T6AINPPS3_LENGTH                equ 0001h
T6AINPPS_T6AINPPS3_MASK                  equ 0008h
T6AINPPS_T6AINPPS4_POSN                  equ 0004h
T6AINPPS_T6AINPPS4_POSITION              equ 0004h
T6AINPPS_T6AINPPS4_SIZE                  equ 0001h
T6AINPPS_T6AINPPS4_LENGTH                equ 0001h
T6AINPPS_T6AINPPS4_MASK                  equ 0010h

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 0EA1h
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0005h
CCP1PPS_CCP1PPS_LENGTH                   equ 0005h
CCP1PPS_CCP1PPS_MASK                     equ 001Fh
CCP1PPS_CCP1PPS0_POSN                    equ 0000h
CCP1PPS_CCP1PPS0_POSITION                equ 0000h
CCP1PPS_CCP1PPS0_SIZE                    equ 0001h
CCP1PPS_CCP1PPS0_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS0_MASK                    equ 0001h
CCP1PPS_CCP1PPS1_POSN                    equ 0001h
CCP1PPS_CCP1PPS1_POSITION                equ 0001h
CCP1PPS_CCP1PPS1_SIZE                    equ 0001h
CCP1PPS_CCP1PPS1_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS1_MASK                    equ 0002h
CCP1PPS_CCP1PPS2_POSN                    equ 0002h
CCP1PPS_CCP1PPS2_POSITION                equ 0002h
CCP1PPS_CCP1PPS2_SIZE                    equ 0001h
CCP1PPS_CCP1PPS2_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS2_MASK                    equ 0004h
CCP1PPS_CCP1PPS3_POSN                    equ 0003h
CCP1PPS_CCP1PPS3_POSITION                equ 0003h
CCP1PPS_CCP1PPS3_SIZE                    equ 0001h
CCP1PPS_CCP1PPS3_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS3_MASK                    equ 0008h
CCP1PPS_CCP1PPS4_POSN                    equ 0004h
CCP1PPS_CCP1PPS4_POSITION                equ 0004h
CCP1PPS_CCP1PPS4_SIZE                    equ 0001h
CCP1PPS_CCP1PPS4_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS4_MASK                    equ 0010h

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 0EA2h
// bitfield definitions
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0005h
CCP2PPS_CCP2PPS_LENGTH                   equ 0005h
CCP2PPS_CCP2PPS_MASK                     equ 001Fh
CCP2PPS_CCP2PPS0_POSN                    equ 0000h
CCP2PPS_CCP2PPS0_POSITION                equ 0000h
CCP2PPS_CCP2PPS0_SIZE                    equ 0001h
CCP2PPS_CCP2PPS0_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS0_MASK                    equ 0001h
CCP2PPS_CCP2PPS1_POSN                    equ 0001h
CCP2PPS_CCP2PPS1_POSITION                equ 0001h
CCP2PPS_CCP2PPS1_SIZE                    equ 0001h
CCP2PPS_CCP2PPS1_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS1_MASK                    equ 0002h
CCP2PPS_CCP2PPS2_POSN                    equ 0002h
CCP2PPS_CCP2PPS2_POSITION                equ 0002h
CCP2PPS_CCP2PPS2_SIZE                    equ 0001h
CCP2PPS_CCP2PPS2_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS2_MASK                    equ 0004h
CCP2PPS_CCP2PPS3_POSN                    equ 0003h
CCP2PPS_CCP2PPS3_POSITION                equ 0003h
CCP2PPS_CCP2PPS3_SIZE                    equ 0001h
CCP2PPS_CCP2PPS3_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS3_MASK                    equ 0008h
CCP2PPS_CCP2PPS4_POSN                    equ 0004h
CCP2PPS_CCP2PPS4_POSITION                equ 0004h
CCP2PPS_CCP2PPS4_SIZE                    equ 0001h
CCP2PPS_CCP2PPS4_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS4_MASK                    equ 0010h

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
CCP3PPS                                  equ 0EA3h
// bitfield definitions
CCP3PPS_CCP3PPS_POSN                     equ 0000h
CCP3PPS_CCP3PPS_POSITION                 equ 0000h
CCP3PPS_CCP3PPS_SIZE                     equ 0005h
CCP3PPS_CCP3PPS_LENGTH                   equ 0005h
CCP3PPS_CCP3PPS_MASK                     equ 001Fh
CCP3PPS_CCP3PPS0_POSN                    equ 0000h
CCP3PPS_CCP3PPS0_POSITION                equ 0000h
CCP3PPS_CCP3PPS0_SIZE                    equ 0001h
CCP3PPS_CCP3PPS0_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS0_MASK                    equ 0001h
CCP3PPS_CCP3PPS1_POSN                    equ 0001h
CCP3PPS_CCP3PPS1_POSITION                equ 0001h
CCP3PPS_CCP3PPS1_SIZE                    equ 0001h
CCP3PPS_CCP3PPS1_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS1_MASK                    equ 0002h
CCP3PPS_CCP3PPS2_POSN                    equ 0002h
CCP3PPS_CCP3PPS2_POSITION                equ 0002h
CCP3PPS_CCP3PPS2_SIZE                    equ 0001h
CCP3PPS_CCP3PPS2_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS2_MASK                    equ 0004h
CCP3PPS_CCP3PPS3_POSN                    equ 0003h
CCP3PPS_CCP3PPS3_POSITION                equ 0003h
CCP3PPS_CCP3PPS3_SIZE                    equ 0001h
CCP3PPS_CCP3PPS3_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS3_MASK                    equ 0008h
CCP3PPS_CCP3PPS4_POSN                    equ 0004h
CCP3PPS_CCP3PPS4_POSITION                equ 0004h
CCP3PPS_CCP3PPS4_SIZE                    equ 0001h
CCP3PPS_CCP3PPS4_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS4_MASK                    equ 0010h

// Register: CCP4PPS
#define CCP4PPS CCP4PPS
CCP4PPS                                  equ 0EA4h
// bitfield definitions
CCP4PPS_CCP4PPS_POSN                     equ 0000h
CCP4PPS_CCP4PPS_POSITION                 equ 0000h
CCP4PPS_CCP4PPS_SIZE                     equ 0005h
CCP4PPS_CCP4PPS_LENGTH                   equ 0005h
CCP4PPS_CCP4PPS_MASK                     equ 001Fh
CCP4PPS_CCP4PPS0_POSN                    equ 0000h
CCP4PPS_CCP4PPS0_POSITION                equ 0000h
CCP4PPS_CCP4PPS0_SIZE                    equ 0001h
CCP4PPS_CCP4PPS0_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS0_MASK                    equ 0001h
CCP4PPS_CCP4PPS1_POSN                    equ 0001h
CCP4PPS_CCP4PPS1_POSITION                equ 0001h
CCP4PPS_CCP4PPS1_SIZE                    equ 0001h
CCP4PPS_CCP4PPS1_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS1_MASK                    equ 0002h
CCP4PPS_CCP4PPS2_POSN                    equ 0002h
CCP4PPS_CCP4PPS2_POSITION                equ 0002h
CCP4PPS_CCP4PPS2_SIZE                    equ 0001h
CCP4PPS_CCP4PPS2_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS2_MASK                    equ 0004h
CCP4PPS_CCP4PPS3_POSN                    equ 0003h
CCP4PPS_CCP4PPS3_POSITION                equ 0003h
CCP4PPS_CCP4PPS3_SIZE                    equ 0001h
CCP4PPS_CCP4PPS3_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS3_MASK                    equ 0008h
CCP4PPS_CCP4PPS4_POSN                    equ 0004h
CCP4PPS_CCP4PPS4_POSITION                equ 0004h
CCP4PPS_CCP4PPS4_SIZE                    equ 0001h
CCP4PPS_CCP4PPS4_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS4_MASK                    equ 0010h

// Register: CCP5PPS
#define CCP5PPS CCP5PPS
CCP5PPS                                  equ 0EA5h
// bitfield definitions
CCP5PPS_CCP5PPS_POSN                     equ 0000h
CCP5PPS_CCP5PPS_POSITION                 equ 0000h
CCP5PPS_CCP5PPS_SIZE                     equ 0005h
CCP5PPS_CCP5PPS_LENGTH                   equ 0005h
CCP5PPS_CCP5PPS_MASK                     equ 001Fh
CCP5PPS_CCP5PPS0_POSN                    equ 0000h
CCP5PPS_CCP5PPS0_POSITION                equ 0000h
CCP5PPS_CCP5PPS0_SIZE                    equ 0001h
CCP5PPS_CCP5PPS0_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS0_MASK                    equ 0001h
CCP5PPS_CCP5PPS1_POSN                    equ 0001h
CCP5PPS_CCP5PPS1_POSITION                equ 0001h
CCP5PPS_CCP5PPS1_SIZE                    equ 0001h
CCP5PPS_CCP5PPS1_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS1_MASK                    equ 0002h
CCP5PPS_CCP5PPS2_POSN                    equ 0002h
CCP5PPS_CCP5PPS2_POSITION                equ 0002h
CCP5PPS_CCP5PPS2_SIZE                    equ 0001h
CCP5PPS_CCP5PPS2_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS2_MASK                    equ 0004h
CCP5PPS_CCP5PPS3_POSN                    equ 0003h
CCP5PPS_CCP5PPS3_POSITION                equ 0003h
CCP5PPS_CCP5PPS3_SIZE                    equ 0001h
CCP5PPS_CCP5PPS3_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS3_MASK                    equ 0008h
CCP5PPS_CCP5PPS4_POSN                    equ 0004h
CCP5PPS_CCP5PPS4_POSITION                equ 0004h
CCP5PPS_CCP5PPS4_SIZE                    equ 0001h
CCP5PPS_CCP5PPS4_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS4_MASK                    equ 0010h

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
SMT1WINPPS                               equ 0EA9h
// bitfield definitions
SMT1WINPPS_SMT1WINPPS_POSN               equ 0000h
SMT1WINPPS_SMT1WINPPS_POSITION           equ 0000h
SMT1WINPPS_SMT1WINPPS_SIZE               equ 0005h
SMT1WINPPS_SMT1WINPPS_LENGTH             equ 0005h
SMT1WINPPS_SMT1WINPPS_MASK               equ 001Fh
SMT1WINPPS_SMU1WINPPS0_POSN              equ 0000h
SMT1WINPPS_SMU1WINPPS0_POSITION          equ 0000h
SMT1WINPPS_SMU1WINPPS0_SIZE              equ 0001h
SMT1WINPPS_SMU1WINPPS0_LENGTH            equ 0001h
SMT1WINPPS_SMU1WINPPS0_MASK              equ 0001h
SMT1WINPPS_SMU1WINPPS1_POSN              equ 0001h
SMT1WINPPS_SMU1WINPPS1_POSITION          equ 0001h
SMT1WINPPS_SMU1WINPPS1_SIZE              equ 0001h
SMT1WINPPS_SMU1WINPPS1_LENGTH            equ 0001h
SMT1WINPPS_SMU1WINPPS1_MASK              equ 0002h
SMT1WINPPS_SMU1WINPPS2_POSN              equ 0002h
SMT1WINPPS_SMU1WINPPS2_POSITION          equ 0002h
SMT1WINPPS_SMU1WINPPS2_SIZE              equ 0001h
SMT1WINPPS_SMU1WINPPS2_LENGTH            equ 0001h
SMT1WINPPS_SMU1WINPPS2_MASK              equ 0004h
SMT1WINPPS_SMU1WINPPS3_POSN              equ 0003h
SMT1WINPPS_SMU1WINPPS3_POSITION          equ 0003h
SMT1WINPPS_SMU1WINPPS3_SIZE              equ 0001h
SMT1WINPPS_SMU1WINPPS3_LENGTH            equ 0001h
SMT1WINPPS_SMU1WINPPS3_MASK              equ 0008h
SMT1WINPPS_SMU1WINPPS4_POSN              equ 0004h
SMT1WINPPS_SMU1WINPPS4_POSITION          equ 0004h
SMT1WINPPS_SMU1WINPPS4_SIZE              equ 0001h
SMT1WINPPS_SMU1WINPPS4_LENGTH            equ 0001h
SMT1WINPPS_SMU1WINPPS4_MASK              equ 0010h

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
SMT1SIGPPS                               equ 0EAAh
// bitfield definitions
SMT1SIGPPS_SMT1SIGPPS_POSN               equ 0000h
SMT1SIGPPS_SMT1SIGPPS_POSITION           equ 0000h
SMT1SIGPPS_SMT1SIGPPS_SIZE               equ 0005h
SMT1SIGPPS_SMT1SIGPPS_LENGTH             equ 0005h
SMT1SIGPPS_SMT1SIGPPS_MASK               equ 001Fh
SMT1SIGPPS_SMU1SIGPPS0_POSN              equ 0000h
SMT1SIGPPS_SMU1SIGPPS0_POSITION          equ 0000h
SMT1SIGPPS_SMU1SIGPPS0_SIZE              equ 0001h
SMT1SIGPPS_SMU1SIGPPS0_LENGTH            equ 0001h
SMT1SIGPPS_SMU1SIGPPS0_MASK              equ 0001h
SMT1SIGPPS_SMU1SIGPPS1_POSN              equ 0001h
SMT1SIGPPS_SMU1SIGPPS1_POSITION          equ 0001h
SMT1SIGPPS_SMU1SIGPPS1_SIZE              equ 0001h
SMT1SIGPPS_SMU1SIGPPS1_LENGTH            equ 0001h
SMT1SIGPPS_SMU1SIGPPS1_MASK              equ 0002h
SMT1SIGPPS_SMU1SIGPPS2_POSN              equ 0002h
SMT1SIGPPS_SMU1SIGPPS2_POSITION          equ 0002h
SMT1SIGPPS_SMU1SIGPPS2_SIZE              equ 0001h
SMT1SIGPPS_SMU1SIGPPS2_LENGTH            equ 0001h
SMT1SIGPPS_SMU1SIGPPS2_MASK              equ 0004h
SMT1SIGPPS_SMU1SIGPPS3_POSN              equ 0003h
SMT1SIGPPS_SMU1SIGPPS3_POSITION          equ 0003h
SMT1SIGPPS_SMU1SIGPPS3_SIZE              equ 0001h
SMT1SIGPPS_SMU1SIGPPS3_LENGTH            equ 0001h
SMT1SIGPPS_SMU1SIGPPS3_MASK              equ 0008h
SMT1SIGPPS_SMU1SIGPPS4_POSN              equ 0004h
SMT1SIGPPS_SMU1SIGPPS4_POSITION          equ 0004h
SMT1SIGPPS_SMU1SIGPPS4_SIZE              equ 0001h
SMT1SIGPPS_SMU1SIGPPS4_LENGTH            equ 0001h
SMT1SIGPPS_SMU1SIGPPS4_MASK              equ 0010h

// Register: SMT2WINPPS
#define SMT2WINPPS SMT2WINPPS
SMT2WINPPS                               equ 0EABh
// bitfield definitions
SMT2WINPPS_SMT2WINPPS_POSN               equ 0000h
SMT2WINPPS_SMT2WINPPS_POSITION           equ 0000h
SMT2WINPPS_SMT2WINPPS_SIZE               equ 0005h
SMT2WINPPS_SMT2WINPPS_LENGTH             equ 0005h
SMT2WINPPS_SMT2WINPPS_MASK               equ 001Fh
SMT2WINPPS_SMU2WINPPS0_POSN              equ 0000h
SMT2WINPPS_SMU2WINPPS0_POSITION          equ 0000h
SMT2WINPPS_SMU2WINPPS0_SIZE              equ 0001h
SMT2WINPPS_SMU2WINPPS0_LENGTH            equ 0001h
SMT2WINPPS_SMU2WINPPS0_MASK              equ 0001h
SMT2WINPPS_SMU2WINPPS1_POSN              equ 0001h
SMT2WINPPS_SMU2WINPPS1_POSITION          equ 0001h
SMT2WINPPS_SMU2WINPPS1_SIZE              equ 0001h
SMT2WINPPS_SMU2WINPPS1_LENGTH            equ 0001h
SMT2WINPPS_SMU2WINPPS1_MASK              equ 0002h
SMT2WINPPS_SMU2WINPPS2_POSN              equ 0002h
SMT2WINPPS_SMU2WINPPS2_POSITION          equ 0002h
SMT2WINPPS_SMU2WINPPS2_SIZE              equ 0001h
SMT2WINPPS_SMU2WINPPS2_LENGTH            equ 0001h
SMT2WINPPS_SMU2WINPPS2_MASK              equ 0004h
SMT2WINPPS_SMU2WINPPS3_POSN              equ 0003h
SMT2WINPPS_SMU2WINPPS3_POSITION          equ 0003h
SMT2WINPPS_SMU2WINPPS3_SIZE              equ 0001h
SMT2WINPPS_SMU2WINPPS3_LENGTH            equ 0001h
SMT2WINPPS_SMU2WINPPS3_MASK              equ 0008h
SMT2WINPPS_SMU2WINPPS4_POSN              equ 0004h
SMT2WINPPS_SMU2WINPPS4_POSITION          equ 0004h
SMT2WINPPS_SMU2WINPPS4_SIZE              equ 0001h
SMT2WINPPS_SMU2WINPPS4_LENGTH            equ 0001h
SMT2WINPPS_SMU2WINPPS4_MASK              equ 0010h

// Register: SMT2SIGPPS
#define SMT2SIGPPS SMT2SIGPPS
SMT2SIGPPS                               equ 0EACh
// bitfield definitions
SMT2SIGPPS_SMT2SIGPPS_POSN               equ 0000h
SMT2SIGPPS_SMT2SIGPPS_POSITION           equ 0000h
SMT2SIGPPS_SMT2SIGPPS_SIZE               equ 0005h
SMT2SIGPPS_SMT2SIGPPS_LENGTH             equ 0005h
SMT2SIGPPS_SMT2SIGPPS_MASK               equ 001Fh
SMT2SIGPPS_SMU2SIGPPS0_POSN              equ 0000h
SMT2SIGPPS_SMU2SIGPPS0_POSITION          equ 0000h
SMT2SIGPPS_SMU2SIGPPS0_SIZE              equ 0001h
SMT2SIGPPS_SMU2SIGPPS0_LENGTH            equ 0001h
SMT2SIGPPS_SMU2SIGPPS0_MASK              equ 0001h
SMT2SIGPPS_SMU2SIGPPS1_POSN              equ 0001h
SMT2SIGPPS_SMU2SIGPPS1_POSITION          equ 0001h
SMT2SIGPPS_SMU2SIGPPS1_SIZE              equ 0001h
SMT2SIGPPS_SMU2SIGPPS1_LENGTH            equ 0001h
SMT2SIGPPS_SMU2SIGPPS1_MASK              equ 0002h
SMT2SIGPPS_SMU2SIGPPS2_POSN              equ 0002h
SMT2SIGPPS_SMU2SIGPPS2_POSITION          equ 0002h
SMT2SIGPPS_SMU2SIGPPS2_SIZE              equ 0001h
SMT2SIGPPS_SMU2SIGPPS2_LENGTH            equ 0001h
SMT2SIGPPS_SMU2SIGPPS2_MASK              equ 0004h
SMT2SIGPPS_SMU2SIGPPS3_POSN              equ 0003h
SMT2SIGPPS_SMU2SIGPPS3_POSITION          equ 0003h
SMT2SIGPPS_SMU2SIGPPS3_SIZE              equ 0001h
SMT2SIGPPS_SMU2SIGPPS3_LENGTH            equ 0001h
SMT2SIGPPS_SMU2SIGPPS3_MASK              equ 0008h
SMT2SIGPPS_SMU2SIGPPS4_POSN              equ 0004h
SMT2SIGPPS_SMU2SIGPPS4_POSITION          equ 0004h
SMT2SIGPPS_SMU2SIGPPS4_SIZE              equ 0001h
SMT2SIGPPS_SMU2SIGPPS4_LENGTH            equ 0001h
SMT2SIGPPS_SMU2SIGPPS4_MASK              equ 0010h

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
CWG1PPS                                  equ 0EB1h
// bitfield definitions
CWG1PPS_CWG1PPS_POSN                     equ 0000h
CWG1PPS_CWG1PPS_POSITION                 equ 0000h
CWG1PPS_CWG1PPS_SIZE                     equ 0005h
CWG1PPS_CWG1PPS_LENGTH                   equ 0005h
CWG1PPS_CWG1PPS_MASK                     equ 001Fh
CWG1PPS_CWG1PPS0_POSN                    equ 0000h
CWG1PPS_CWG1PPS0_POSITION                equ 0000h
CWG1PPS_CWG1PPS0_SIZE                    equ 0001h
CWG1PPS_CWG1PPS0_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS0_MASK                    equ 0001h
CWG1PPS_CWG1PPS1_POSN                    equ 0001h
CWG1PPS_CWG1PPS1_POSITION                equ 0001h
CWG1PPS_CWG1PPS1_SIZE                    equ 0001h
CWG1PPS_CWG1PPS1_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS1_MASK                    equ 0002h
CWG1PPS_CWG1PPS2_POSN                    equ 0002h
CWG1PPS_CWG1PPS2_POSITION                equ 0002h
CWG1PPS_CWG1PPS2_SIZE                    equ 0001h
CWG1PPS_CWG1PPS2_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS2_MASK                    equ 0004h
CWG1PPS_CWG1PPS3_POSN                    equ 0003h
CWG1PPS_CWG1PPS3_POSITION                equ 0003h
CWG1PPS_CWG1PPS3_SIZE                    equ 0001h
CWG1PPS_CWG1PPS3_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS3_MASK                    equ 0008h
CWG1PPS_CWG1PPS4_POSN                    equ 0004h
CWG1PPS_CWG1PPS4_POSITION                equ 0004h
CWG1PPS_CWG1PPS4_SIZE                    equ 0001h
CWG1PPS_CWG1PPS4_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS4_MASK                    equ 0010h

